demo/FSIBeam_interFSIFoam_2206/sub-iter_5/caseTest/fluidDomain/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          128;
        startFace       17792;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       17920;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          416;
        startFace       18048;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          384;
        startFace       18464;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       18848;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          800;
        startFace       19648;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       20448;
    }
)

// ************************************************************************* //
