demo/FSIBeam_interFSIFoam_2206/sub-iter_5/caseTest/fluidDomain/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              nu    [ 0  2 -1  0  0  0  0 ] 1e-06;
    rho             rho   [ 1 -3  0  0  0  0  0 ] 1000;
}

air
{
    transportModel  Newtonian;
    nu              nu    [ 0  2 -1  0  0  0  0 ] 1.48e-05;
    rho             rho   [ 1 -3  0  0  0  0  0 ] 1.0;
}

sigma            0.07;


// ************************************************************************* //
